src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Сотрудник является клиентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIВес</Name>
					<Comment>Вес сотрудника для API, сначала выводятся более тяжелые</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОМС</Name>
					<Comment>Код по ОМС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляСайтаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДляОнлайнЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПользовательИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпецилазацииСотрудника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Comment>Специализация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Comment>Основная специализация</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеКассы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницыЖурналаЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЗначенияДополнительныхПравПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхПравПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПраваПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Право</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПраваПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Сотрудники/Forms/ФормаНастройки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Сотрудник", Сотрудник);
	Параметры.Свойство("Отказ", Отказ);
	ПостроитьДеревоНастроек();
	Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", Сотрудник.ИдентификаторПользователяИБ);
	ЗаполнитьНастройки();
	Элементы.ГруппаОбщиеНастройки.Видимость = Пользователь.ЭтоПользовательИБ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)	
	
	Если ИмяСобытия = "НастройкиПользователей" Тогда
		
		Если Сотрудник = Параметр
			И ВладелецФормы = Источник Тогда 
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоОбщихНастроек

&НаКлиенте
// Процедура, обработчик события "ПриОкончанииРедактирования"
//
Процедура ДеревоОбщихНастроекПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
		
	ЗаписатьНастройкиПользователя();
	Оповестить("НастройкиПользователей", Сотрудник, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ДеревоОбщихНастроекПриИзменении(Элемент)
	
	Если Элементы.ДеревоОбщихНастроек.ТекущиеДанные.Значение = 2 Тогда
		
		Элементы.ДеревоОбщихНастроек.ТекущиеДанные.Значение = 0;
	КонецЕсли;

	Если Элементы.ДеревоОбщихНастроек.ТекущиеДанные.ЭтоГруппа Тогда
		Для Каждого СтрокаТЧ из Элементы.ДеревоОбщихНастроек.ТекущиеДанные.ПолучитьЭлементы() Цикл
			СтрокаТЧ.Значение = Элементы.ДеревоОбщихНастроек.ТекущиеДанные.Значение;
		КонецЦикла;
	Иначе
		СтрокаРодитель = Элементы.ДеревоОбщихНастроек.ТекущиеДанные.ПолучитьРодителя();
		КоличествоФлагов = 0;
		Для Каждого СтрокаТЧ из СтрокаРодитель.ПолучитьЭлементы() Цикл
			Если СтрокаТЧ.Значение = 1 Тогда
				КоличествоФлагов = КоличествоФлагов + 1;
			КонецЕсли;
		КонецЦикла;	
		Если КоличествоФлагов = СтрокаРодитель.ПолучитьЭлементы().Количество() Тогда
			СтрокаРодитель.Значение = 1;
		ИначеЕсли КоличествоФлагов = 0 Тогда
			СтрокаРодитель.Значение = 0;
		Иначе
			СтрокаРодитель.Значение = 2;
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.ДеревоОбщихНастроек.ТекущиеДанные.Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.ПраваПользователей.ЗапрашиватьПодтверждениеПриЗакрытии") 
		И Пользователь = ОбщегоНазначения.ТекущийПользователь() Тогда 
		СтандартныеПодсистемыКлиент.УстановитьПараметрКлиента("ЗапрашиватьПодтверждениеПриЗакрытии", Булево(Элементы.ДеревоОбщихНастроек.ТекущиеДанные.Значение));
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ДеревоНастроекНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Настройка = Элементы.ДеревоНастроек.ТекущиеДанные.Настройка;
	Если Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнойСклад") Тогда
		
		СтандартнаяОбработка = Ложь;
		СтруктурнаяЕдиница = ПолучитьСтруктурнуюЕдиницу(МестаРаботы, СтрЗаменить(Элемент.Имя, "СтруктурнаяЕдиница", ""));
		
		ОткрытьФорму("Справочник.Склады.ФормаВыбора", Новый Структура("Отбор", Новый Структура("СтруктурнаяЕдиница", СтруктурнаяЕдиница)), Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяГруппаКонтрагентов") Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбораГруппы",, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриАктивизацииСтроки"
//
Процедура ДеревоНастроеккПриАктивизацииЯчейки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено и НЕ Элемент.ТекущийЭлемент.Имя = "Настройка" Тогда 	
		Элемент.ТекущийЭлемент.ФорматРедактирования = "";  	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "АвтоПодбор"
//
Процедура ДеревоНастроекАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		
		Настройка = Элементы.ДеревоНастроек.ТекущиеДанные.Настройка;
		
		Если Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяГруппаКонтрагентов") Тогда
			
			СтандартнаяОбработка = Ложь;
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Очистить();
			ДанныеВыбора.ЗагрузитьЗначения(ПолучитьМассивГруппПоиска(Текст));
			
		ИначеЕсли Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнойСклад") Тогда	
			
			ПараметрыПолученияДанных.Отбор.Вставить("СтруктурнаяЕдиница", ПолучитьСтруктурнуюЕдиницу(МестаРаботы, СтрЗаменить(Элемент.Имя, "СтруктурнаяЕдиница", "")));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, строит дерево настроек
//
Процедура ПостроитьДеревоНастроек()
	
	масРеквизитов = Новый Массив; 	
	
	ИмяДерева = "ДеревоНастроек";
	масРеквизитов.Добавить(Новый РеквизитФормы(ИмяДерева   , Новый ОписаниеТипов("ДеревоЗначений"), , "Настройки сотрудников", Ложь));	
	масРеквизитов.Добавить(Новый РеквизитФормы("Настройка" , Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.НастройкиПользователей"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("ЭтоГруппа" , Новый ОписаниеТипов("Булево"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("Оформление", Новый ОписаниеТипов("Булево"), ИмяДерева));
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиДоступныеСтруктурныеЕдиницы.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВременнаяТаблицаНастроек
	|ИЗ
	|	Справочник.Сотрудники.ДоступныеСтруктурныеЕдиницы КАК СотрудникиДоступныеСтруктурныеЕдиницы
	|ГДЕ
	|	СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|   И СотрудникиДоступныеСтруктурныеЕдиницы.Ссылка = &Сотрудник
	|	И НЕ СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.ЭтоГруппа
	|	И НЕ СотрудникиДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаНастроек.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВременнаяТаблицаНастроек.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВременнаяТаблицаНастроек КАК ВременнаяТаблицаНастроек");
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	МестаРаботы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для Каждого СтрокаТЧ из МестаРаботы Цикл		
		Наименование = "СтруктурнаяЕдиница" + СтрокаТЧ.НомерСтроки;
		масРеквизитов.Добавить(Новый РеквизитФормы(Наименование, Метаданные.ПланыВидовХарактеристик.НастройкиПользователей.Тип, ИмяДерева));
	КонецЦикла;
	ЭтаФорма.ИзменитьРеквизиты(масРеквизитов); 
	
	ЭлементДерево = Элементы.Добавить("ДеревоНастроек", Тип("ТаблицаФормы"), Элементы.ГруппаНастройкиПоСтруктурнымЕдиницам);
    ЭлементДерево.ПутьКДанным 				 = "ДеревоНастроек";
    ЭлементДерево.Отображение 				 = ОтображениеТаблицы.Дерево;
	ЭлементДерево.КоманднаяПанель.Видимость  = Ложь;
	ЭлементДерево.КонтекстноеМеню.Видимость  = Ложь;
	ЭлементДерево.ПоложениеКоманднойПанели   = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ЭлементДерево.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
    ЭлементДерево.УстановитьДействие("ПриОкончанииРедактирования", "ДеревоОбщихНастроекПриОкончанииРедактирования");
	ЭлементДерево.УстановитьДействие("ПриАктивизацииЯчейки"		 , "ДеревоНастроеккПриАктивизацииЯчейки");
		
	НовыйЭлемент                   = Элементы.Добавить("Настройка", Тип("ПолеФормы"), ЭлементДерево);		
	НовыйЭлемент.Вид 		       = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным       = "ДеревоНастроек.Настройка";
	НовыйЭлемент.ТолькоПросмотр    = Истина; 
	НовыйЭлемент.ЦветФонаЗаголовка = Новый Цвет(255, 255, 255); 
	
	Для Каждого СтрокаТЧ Из МестаРаботы Цикл
		
		Наименование = "СтруктурнаяЕдиница" + СтрокаТЧ.НомерСтроки;
		
		НовыйЭлемент = Элементы.Добавить(Наименование, Тип("ПолеФормы"), ЭлементДерево);
		НовыйЭлемент.Заголовок 	 			 = СтрокаТЧ.СтруктурнаяЕдиница.Наименование;
		НовыйЭлемент.Вид 		 			 = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 			 = "ДеревоНастроек.СтруктурнаяЕдиница" + СтрокаТЧ.НомерСтроки;
		НовыйЭлемент.СвязьПоТипу 			 = Новый СвязьПоТипу("Элементы.ДеревоНастроек.ТекущиеДанные.Настройка", 0);
		НовыйЭлемент.ИсторияВыбораПриВводе 	 = ИсторияВыбораПриВводе.НеИспользовать;
		НовыйЭлемент.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;
		НовыйЭлемент.КнопкаСоздания 		 = Ложь;
		НовыйЭлемент.ЦветФонаЗаголовка       = Новый Цвет(255, 255, 255); 
		
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ДеревоНастроекНачалоВыбора");
		НовыйЭлемент.УстановитьДействие("АвтоПодбор"  , "ДеревоНастроекАвтоПодбор");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет настройки по сотруднику
//
Процедура ЗаполнитьНастройки()
	
	ДеревоЭлементы = ЭтаФорма.ДеревоНастроек.ПолучитьЭлементы();
	ДеревоЭлементы.Очистить();   	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиПользователей.Настройка КАК Настройка,
	|	НастройкиПользователей.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НастройкиПользователей.Значение КАК Значение
	|ПОМЕСТИТЬ втНастройкиПользователя
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Настройки.Наименование КАК Наименование,
	|	Настройки.Ссылка КАК Ссылка,
	|	Настройки.Родитель КАК Родитель,
	|	Настройки.ЭтоГруппа КАК ЭтоГруппа,
	|	втНастройкиПользователя.Настройка КАК Настройка,
	|	втНастройкиПользователя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	втНастройкиПользователя.Значение КАК Значение
	|ИЗ
	|	ПланВидовХарактеристик.НастройкиПользователей КАК Настройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНастройкиПользователя КАК втНастройкиПользователя
	|		ПО Настройки.Ссылка = втНастройкиПользователя.Настройка
	|ГДЕ
	|	НЕ Настройки.ПометкаУдаления
	|	И НЕ Настройки.ЭтоГруппа
	|	И Настройки.Родитель.ИмяПредопределенныхДанных <> ""ЦветаСтатусовПредварительнойЗаписи""
	|	И НЕ Настройки.Ссылка В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяКасса), ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ДатаПриема), ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ДатаУвольнения))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|ИТОГИ ПО
	|	Родитель,
	|	Ссылка");
		
	Запрос.УстановитьПараметр("Пользователь", ?(Пользователь.ЭтоПользовательИБ, Пользователь, Сотрудник));
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл		
	    СтрокаГруппы                  = ДеревоЭлементы;
		СтрокаНастройки               = СтрокаГруппы.Добавить();
		СтрокаНастройки.Настройка     = Выборка.Родитель;
		СтрокаНастройки.ЭтоГруппа     = Истина;			
		СтрокаГруппыЭлементы          = СтрокаНастройки.ПолучитьЭлементы();
		
		ВыборкаНастроек = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНастроек.Следующий() Цикл
			СтрокаНастройки           = СтрокаГруппыЭлементы.Добавить();
			СтрокаНастройки.Настройка = ВыборкаНастроек.Ссылка;
			СтрокаНастройки.ЭтоГруппа = ВыборкаНастроек.ЭтоГруппа;
			
			ВыборкаЗначений = ВыборкаНастроек.Выбрать(ОбходРезультатаЗапроса.Прямой);
			
			Пока ВыборкаЗначений.Следующий() Цикл
				НайденнаяСтрока = МестаРаботы.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница", ВыборкаЗначений.СтруктурнаяЕдиница));
				Если НайденнаяСтрока.Количество() > 0  Тогда
					СтрокаНастройки["СтруктурнаяЕдиница"+НайденнаяСтрока[0].НомерСтроки] = ВыборкаЗначений.Ссылка.ТипЗначения.ПривестиЗначение(ВыборкаЗначений.Значение);				
				КонецЕсли;				
			КонецЦикла;			
		КонецЦикла;		
	КонецЦикла;

	Если Пользователь.ЭтоПользовательИБ Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначениеПрав.Значение КАК Значение,
		|	Права.Ссылка КАК Ссылка,
		|	Права.Наименование КАК Наименование,
		|	Права.ЭтоГруппа КАК ЭтоГруппа,
		|	Права.Родитель КАК Родитель,
		|	НЕ Права.ЭтоГруппа КАК НомерКартинки
		|ИЗ
		|	ПланВидовХарактеристик.ПраваПользователей КАК Права
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхПравПользователя КАК ЗначениеПрав
		|		ПО (ЗначениеПрав.Пользователь = &Пользователь)
		|			И (ЗначениеПрав.Право = Права.Ссылка)
		|ГДЕ
		|	НЕ Права.Ссылка.ПометкаУдаления
		|	И Права.Ссылка.ИмяПредопределенныхДанных <> ""ЗапрашиватьПодтверждениеПриЗакрытии""
		|	И Права.Ссылка.ИмяПредопределенныхДанных <> ""ВыбиратьСтруктурнуюЕдиницу""
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоГруппа ИЕРАРХИЯ,
		|	Права.Наименование");
		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);	
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДеревоЭлементы = ЭтаФорма.ДеревоОбщихНастроек.ПолучитьЭлементы();
		ДеревоЭлементы.Очистить();
		
		Пока Выборка.Следующий() Цикл		
			
			Если Выборка.ЭтоГруппа Тогда
				СтрокаГруппы              = ДеревоЭлементы;
				СтрокаНастройки           = СтрокаГруппы.Добавить();
				СтрокаНастройки.Настройка = Выборка.Ссылка;
				СтрокаНастройки.ЭтоГруппа = Выборка.ЭтоГруппа;			
				СтрокаГруппыЭлементы      = СтрокаНастройки.ПолучитьЭлементы();
				
			Иначе
				СтрокаНастройки           = СтрокаГруппыЭлементы.Добавить();
				СтрокаНастройки.Настройка = Выборка.Ссылка;
				СтрокаНастройки.Значение  = Выборка.Ссылка.ТипЗначения.ПривестиЗначение(Выборка.Значение);
				СтрокаНастройки.ЭтоГруппа = Выборка.ЭтоГруппа;
			КонецЕсли; 
			
		КонецЦикла;  	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура выполняет запись значений настроек в регистр сведений.
//  Параметры:
//   СтруктурнаяЕдиница - СтруктурнаяЕдиница, по которой необходимо добавить набор записей в регистр;
//
Процедура ЗаписатьНастройкиПользователя()

	НеобходимоОбновитьКешПользователя = Ложь;
	ТекущийСотрудник = ПараметрыСеанса.ТекущийПользователь;
	//Если ТекущийСотрудник = Сотрудник Тогда 
	//	СтруктураНастроекОповещения = ОбщегоНазначенияПовтИсп.ПолучитьНастройкиОповещенияПользователяПоВзаимодействиям();
	//Иначе 
	//	СтруктураНастроекОповещения = ОбщегоНазначенияПовтИсп.ПолучитьНастройкиОповещенияПользователяПоВзаимодействиям(Сотрудник);//Новый Структура;
	//КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Пользователь.Использование = Истина;
	НаборЗаписей.Отбор.Пользователь.Значение      = Пользователь;  		
	
	НастройкиГруппы = ДеревоОбщихНастроек.ПолучитьЭлементы();
	Для Каждого ГруппаНастроек Из НастройкиГруппы Цикл    		
		НастройкиЭлементы = ГруппаНастроек.ПолучитьЭлементы();  		
		Для Каждого СтрокаНастроек Из НастройкиЭлементы Цикл
			НоваяЗапись               = НаборЗаписей.Добавить();
			НоваяЗапись.Пользователь  = Пользователь;			
			НоваяЗапись.Право         = СтрокаНастроек.Настройка;
			НоваяЗапись.Значение      = СтрокаНастроек.Настройка.ТипЗначения.ПривестиЗначение(СтрокаНастроек.Значение);
			//Если НЕ НеобходимоОбновитьКешПользователя И НоваяЗапись.Настройка.ИмяПредопределенныхДанных <> "" И СтруктураНастроекОповещения.Свойство(НоваяЗапись.Настройка.ИмяПредопределенныхДанных) Тогда
				//Если НоваяЗапись.Значение <> СтруктураНастроекОповещения[НоваяЗапись.Настройка.ИмяПредопределенныхДанных] Тогда 
				//	НеобходимоОбновитьКешПользователя = Истина;
				//КонецЕсли;	
			//КонецЕсли;	
		КонецЦикла;  		
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка сохранения прав пользователя в регистр ""ЗначенияДополнительныхПравПользователя""", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());	
	КонецПопытки;	
		
	НовыйНаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	
	НовыйНаборЗаписей.Отбор.Пользователь.Использование = Истина;	
	НовыйНаборЗаписей.Отбор.Пользователь.Значение      = ?(Пользователь.ЭтоПользовательИБ, Пользователь, Сотрудник); 
	
	НастройкиГруппы = ЭтаФорма.ДеревоНастроек.ПолучитьЭлементы();
	Для Каждого ГруппаНастроек Из НастройкиГруппы Цикл    		
		НастройкиЭлементы = ГруппаНастроек.ПолучитьЭлементы(); 		
		Для Каждого СтрокаСЕ из МестаРаботы Цикл  			
			Для Каждого СтрокаНастроек Из НастройкиЭлементы Цикл
				НоваяЗаписьПользователя                    = НовыйНаборЗаписей.Добавить();
				НоваяЗаписьПользователя.Пользователь       = ?(Пользователь.ЭтоПользовательИБ, Пользователь, Сотрудник);
				НоваяЗаписьПользователя.СтруктурнаяЕдиница = СтрокаСЕ.СтруктурнаяЕдиница;
				НоваяЗаписьПользователя.Настройка          = СтрокаНастроек.Настройка;
				НоваяЗаписьПользователя.Значение           = СтрокаНастроек.Настройка.ТипЗначения.ПривестиЗначение(СтрокаНастроек["СтруктурнаяЕдиница"+СтрокаСЕ.НомерСтроки]);   			
			КонецЦикла;  		
		КонецЦикла;
	КонецЦикла; 	

	Попытка
		НовыйНаборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка сохранения настроек пользователя в регистр ""НастройкиПользователей""", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());	
	КонецПопытки;
	
	Если НеобходимоОбновитьКешПользователя Тогда
		Если ТекущийСотрудник = Сотрудник Тогда 
			ОбновитьПовторноИспользуемыеЗначения();	
		Иначе 
			
			ИспользоватьСистемуВзаимодействия = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена();
			
			Если ИспользоватьСистемуВзаимодействия = Истина Тогда
				
				МассивСотрудников = ОбсужденияСистемыВзаимодействия.ПолучитьМассивАктивныхСотрудников(Сотрудник);
				Если ЗначениеЗаполнено(МассивСотрудников) Тогда 
					
					// Оповещение через систему взаимодействия.
					ДанныеСообщения = Новый Структура;
					ДанныеСообщения.Вставить("Ключ", "НеобходимоОбновитьКешНастроекПоОповещениямВзаимодействий");
					
					ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, МассивСотрудников); 
					
				КонецЕсли;				
			Иначе
				
				// Оповещение через регистр сведений.
				ПараметрыОповещения = Новый_Массив(Сотрудник);
				РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(Сотрудник,
																					   Неопределено, 
																					   "НеобходимоОбновитьКешНастроекПоОповещениямВзаимодействий", 
																					   ТекущаяДатаСеанса(),,,, 
																					   ПараметрыОповещения);
		  	КонецЕсли;
																				   
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбновитьНастройки(

&НаСервереБезКонтекста
// Функция, возвращает структурную единицу
//
Функция ПолучитьСтруктурнуюЕдиницу(знач МестаРаботы, НомерСтроки)	
	
	Возврат МестаРаботы[Число(НомерСтроки) - 1].СтруктурнаяЕдиница;	
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить массив групп поиска
//
// Параметры:
//  Текст	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивГруппПоиска(Текст)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ПометкаУдаления = ЛОЖЬ
	|	И Контрагенты.ЭтоГруппа = ИСТИНА
	|	И Контрагенты.Наименование ПОДОБНО &Поиск");
	
	Запрос.УстановитьПараметр("Поиск", "%" + Текст + "%");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти
